---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.FromRoom(Autodesk.Revit.DB.Phase)
zh: 族实例
source: html/c4a37990-0603-50e0-ca97-1cd5449940dd.htm
---
# Autodesk.Revit.DB.FamilyInstance.FromRoom Property

**中文**: 族实例

## Syntax (C#)
```csharp
public Room this[
	Phase phase
] { get; }
```

## Parameters
- **phase** (`Autodesk.Revit.DB.Phase`)